 
                                  3/14 ﾀﾌﾞﾚｯﾄﾄｳﾆｭｳ
ｽﾀｰﾄ P=10          §1/14  ﾀﾌﾞﾚｯﾄ§2
ﾖｳｶｲﾁｭｳ §3:§4       ﾀﾌﾞﾚｯﾄ ﾄｳﾆｭｳ
ｵｽ     P10=ｽﾀｰﾄ        ﾀﾌﾞﾚｯﾄ ﾖｳｶｲﾁｭｳ
§1:§2                ﾌﾞﾘｭｰﾜｰ ｸﾘｰﾆﾝｸﾞ
6 X          §1     ｵﾏﾁｸﾀﾞｻｲ
                            
                                  2/14 ｸﾘｰﾆﾝｸﾞ
ｱｸﾃｨﾌﾞ                 ｸﾘｰﾆﾝｸﾞ
ｱｸﾃｨﾌﾞ                       
                                  11/14 ｺｰﾋｰ ｽｽｷﾞ
ｽｷｯﾌﾟ ｼﾏｽ YES=1     §1/14 ｻｲ ｸﾘｰﾆﾝｸﾞ
§2/2 OK=10 NO=ot   1/14 ﾕﾆｯﾄ ﾊｷｿｳｼﾞ
ｵｽ ﾎﾞﾀﾝ 10         4/14 ﾁｭｳｼｭﾂ ﾕﾆｯﾄ
ﾄｼﾞﾏｽ              5/14 2ｶｲﾒ
ｶｲｼ                       §1/14 §2 ｸﾘｰﾆﾝｸ
ﾁｭｳ §3              ﾁｭｳｼｭﾂ ﾕﾆｯﾄ ｦ
ﾋﾗｷﾏｽ                 14/14 ｸﾆｰﾆﾝｸﾞ
ｶﾝﾘｮｳ 10=ｼｭｳﾘｮｳ       §1 ﾐｷｻｰ §2
ｸﾘｰﾆﾝｸﾞ                  §1 ｽｽｷﾞﾏｽ
ﾁｭｳｼｭﾂﾕﾆｯﾄ                ｸﾘｰﾆﾝｸﾞ ｶｲｼ
YES=10 NO=8             §1/14 §2 ｸﾘｰﾆﾝｸ
ｵﾏﾁｸﾀﾞｻｲ            12/14 ｽｽｷﾞ ｺｰﾋｰ
ﾁｭｳｼｭﾂ ﾁｭｳ          §1/§2 ｾｲｿｳ
ｻｷﾞｮｳﾁｭｳ                 §1/§2 ｼﾞｮｷｮｻﾞｲ
ｾﾂｿﾞｸ ｼﾏｽ OK=10      §1/§2 ｼﾞｮｷｮｻﾞｲ
ｼﾞｭｳﾃﾝ ﾁｭｳ           §1/§2 ｷｭｳｽｲ OK?
YES=10              §1/§2 ｼﾞｮｷｮｻﾞｲ
ｼﾞｭｳﾃﾝ               §1/§2 ｽｹｰﾙｼﾞｮｷｮ
§3:§4 ﾌﾝ            §1/§2 ｼﾞｮｷｮｻﾞｲ
ﾊｲｴｷ ﾁｭｳ §3/§4       §1/§2 ｹｯｶ OK?
OK=10 NO=ｿﾉﾀ          §1/§2 ｽｽｷﾞﾐｽﾞ
ｾﾂｿﾞｸ ｼﾏｽ OK=10       §1/§2 ｽｽｷﾞﾐｽﾞ
ｼﾞｭｳﾃﾝﾁｭｳ             §1/§2 ｵﾐｽﾞ ﾃﾞ
ｽｽｷﾞ ﾁｭｳ              §1/§2 ﾐｽﾞ ｦ
ﾃｽﾄ ｼﾏｽ Y=10            §1/§2 ﾃｽﾄ ﾖｳﾉ
ﾐｽﾞｦ ｷｬｯﾁｼﾏｽ          §1/§2 ｽｹｰﾙｼﾞｮｷｮ
ｶﾝﾘｮｳ 10=ﾂｷﾞｴ       §1/§2 ﾄﾞﾚｲﾝ
ﾋﾗｷﾏｽ Y=10              §1/§2 ﾄﾞﾚｲﾝ
ﾄｼﾞﾏｽ Y=10              ｵｰﾄ ﾘﾝｽ
ｻｷﾞｮｳﾁｭｳ                    ﾃｲｷ ｽｽｷﾞ
§1 ﾋﾞｮｳ                    ｸﾘｰﾆﾝｸﾞ  ﾏﾆｭｱﾙ=8
コーヒーを抜く=9 ｵｰﾄ=10    
                                  